const adminMiddleware = (req, res, next) => {
    // Проверка, что пользователь аутентифицирован
    if (!req.user) {
      return res.status(401).json({ message: 'Пользователь не аутентифицирован' });
    }
  
    // Проверка, что пользователь имеет роль администратора
    if (req.user.role !== 'admin') {
      return res.status(403).json({ message: 'Недостаточно прав для выполнения операции' });
    }
  
    // Проверка других условий, например, возраст пользователя
    if (req.user.age < 18) {
      return res.status(403).json({ message: 'Доступ запрещен для пользователей младше 18 лет' });
    }
  
    // Дополнительные функции и проверки, например, проверка допустимых действий администратора
  
    // Проход к следующему middleware или обработчику запроса
    next();
  };
  
  module.exports = adminMiddleware;  